# ColorWithTransparency Constructor (UInt32, UInt32, UInt32, UInt32)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ColorWithTransparency Constructor (UInt32, UInt32, UInt32, UInt32)
ColorWithTransparency Class See Also
---
color
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public ColorWithTransparency(
	uint red,
	uint green,
	uint blue,
	uint transparency
)
```

Visual Basic
---
```text
Public Sub New ( _
	red As UInteger, _
	green As UInteger, _
	blue As UInteger, _
	transparency As UInteger _
)
```

Visual C++
---
```text
public:
ColorWithTransparency(
	unsigned int red,
	unsigned int green,
	unsigned int blue,
	unsigned int transparency
)
```

# ### Parameters
red
    Type: System..::..UInt32 red
green
    Type: System..::..UInt32 green
blue
    Type: System..::..UInt32 blue
transparency
    Type: System..::..UInt32 transparency
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | The value is not valid. The valid range is 0 to 255. |

# See Also
ColorWithTransparency Class
ColorWithTransparency Overload
Autodesk.Revit.DB Namespace